app/services/transfer_creator.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "transfers" ("transferor_id", "transferee_id", "execution_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["transferor_id", 1], ["transferee_id", 2], ["execution_date", "2021-09-01"], ["created_at", "2021-09-05 22:57:32.844829"], ["updated_at", "2021-09-05 22:57:32.844829"]]
INSERT INTO "transfers" ("transferor_id", "transferee_id", "execution_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["transferor_id", 1], ["transferee_id", 2], ["execution_date", "2021-09-01"], ["created_at", "2021-09-05 21:10:44.674027"], ["updated_at", "2021-09-05 21:10:44.674027"]]
INSERT INTO "account_transactions" ("account_id", "amount", "transaction_type", "transfer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["account_id", 2], ["amount", 500.0], ["transaction_type", "withdraw"], ["transfer_id", 1], ["created_at", "2021-09-05 21:48:29.984265"], ["updated_at", "2021-09-05 21:48:29.984265"]]
INSERT INTO "account_transactions" ("transaction_number", "account_id", "amount", "transaction_type", "transfer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "accounts" SET "account_number" = ?, "balance" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["account_number", "4b8036ed-aaa1-46cf-96f0-005d281809cd"], ["balance", -50.0], ["updated_at", "2021-09-05 23:20:04.346098"], ["id", 2]]
UPDATE "accounts" SET "account_number" = ?, "balance" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["account_number", "f1af2dcb-87dd-44aa-8c63-40d37fce602a"], ["balance", 1050.0], ["updated_at", "2021-09-05 23:20:04.348369"], ["id", 1]]
DELETE FROM "transfers" WHERE "transfers"."id" = ?  [["id", 9]]
---
  def send_funds
    transfereeAccount = Account::find(@transferee_id)
    transferorAccount = Account::find(@transferor_id)

    if transferorAccount.balance >= @amount
      begin
        @transfer = Transfer::new(
            transferee_id: @transferee_id,
            transferor_id: @transferor_id,
            execution_date: @execution_date,
          )
        @transfer.save
        ActiveRecord::Base.transaction do
          AccountTransaction::create([{
              account_id: @transferee_id,
              amount: @amount,
              transaction_type: 'deposit',
              transfer_id: @transfer.id
            }])
          AccountTransaction::create([{
              account_id: @transferor_id,
              amount: @amount,
              transaction_type: 'withdraw',
              transfer_id: @transfer.id
            }])
          transfereeAccount.balance = transfereeAccount.balance + @amount
          transfereeAccount.save

          transferorAccount.balance = transferorAccount.balance - @amount
          transferorAccount.save
        end
        return true
      rescue
        Transfer.destroy(@transfer.id)