app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "account_transactions".* FROM "account_transactions" WHERE "account_transactions"."account_id" = ? ORDER BY "account_transactions"."id" DESC LIMIT ?  [["account_id", 1], ["LIMIT", 10]]
---
  def show
    @account = Account.find(params[:id])
    render json: {balance: @account.balance, last_ten_transactions: @account.account_transactions.last(10)}